app/controllers/albums_controller.rb

  def edit
    @album = Album.find_by_id_and_user_id(params[:id], @user)
---
SELECT * FROM `albums` WHERE (`albums`.`user_id` = 1 AND `albums`.`id` = '1') LIMIT 1

  def create
    @album = Album.new(params[:album])
    respond_to do |format|
      if @user.albums << @album
---
INSERT INTO `albums` (`name`, `created_at`, `public`, `updated_at`, `user_id`, `description`, `photos_count`) VALUES('test', '2010-04-01 07:40:07', 1, '2010-04-01 07:40:07', 1, 'aestaset', 0)

  def update
    @album = Album.find_by_id_and_user_id(params[:id], @user)

    respond_to do |format|
      if @album.update_attributes(params[:album])
---
SELECT * FROM `albums` WHERE (`albums`.`user_id` = 1 AND `albums`.`id` = '2') LIMIT 1
UPDATE `albums` SET `updated_at` = '2010-04-01 07:59:52', `description` = 'aetdf' WHERE `id` = 2

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
DELETE FROM `albums` WHERE `id` = 1

  def find_user
    @user = User.find(params[:user_id]) if params[:user_id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)