app/controllers/comments_controller.rb

  def create
    @entry =  Entry.find_by_id_and_user_id(params[:entry_id], params[:user_id])
    @user = @entry.user
    @comment = Comment.new(:user_id => @logged_in_user, :body => params[:comment][:body])
    if @user.enable_comments
      respond_to do |format|
        if @entry.comments << @comment
---
SELECT * FROM `entries` WHERE (`entries`.`user_id` = '1' AND `entries`.`id` IS NULL) LIMIT 1
INSERT INTO `comments` (`guest_name`, `entry_id`, `created_at`, `body`, `guest_email`, `updated_at`, `user_id`, `guest_url`) VALUES(NULL, NULL, '2010-03-31 06:43:37', 'asdfadsf', NULL, '2010-03-31 06:43:37', NULL, NULL)

  def destroy
    @comment = Comment.find(params[:id])
    @entry = @comment.entry
    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 11)
DELETE FROM `comments` WHERE `id` = 11