app/controllers/entries_controller.rb

  def index
    @user = User.find(params[:user_id])
    @entries = Entry.paginate :page => params[:page],
                              :conditions => ['user_id = ?', @user],
                              :order => 'updated_at DESC'
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `entries` WHERE (user_id = 1) ORDER BY updated_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `entries` WHERE (user_id = 1)

  def show
    @entry = Entry.find_by_id_and_user_id(params[:id], params[:user_id], :include => [:user, [:comments => :user]])
---
SELECT * FROM `entries` WHERE (`entries`.`user_id` = '1' AND `entries`.`id` = '3') LIMIT 1

  def edit
    @entry = @logged_in_user.entries.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 3 AND (`entries`.user_id = 1))

  def create
    @entry = Entry.new(params[:entry])
    respond_to do |format|
      if @logged_in_user.entries << @entry
---
INSERT INTO `entries` (`created_at`, `title`, `body`, `updated_at`, `user_id`, `comments_count`) VALUES('2010-03-31 06:01:10', 'my 1st blog', 'my 1st blog', '2010-03-31 06:01:10', 1, 0)

  def update
    @entry =  @logged_in_user.entries.find(params[:id])
    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 4 AND (`entries`.user_id = 1))
UPDATE `entries` SET `updated_at` = '2010-04-01 05:45:33', `title` = 'dsfadsfadfasdfadsfadsf' WHERE `id` = 13

  def destroy
    @entry =  @logged_in_user.entries.find(params[:id])
    @entry.destroy
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 3 AND (`entries`.user_id = 1))
DELETE FROM `entries` WHERE `id` = 3