app/controllers/forums_controller.rb

  def index
    @forums = Forum.all
---
SELECT * FROM `forums`

  def edit
    @forum = Forum.find(params[:id])
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 2)

  def create
    @forum = Forum.new(params[:forum])

    respond_to do |format|
      if @forum.save
---
INSERT INTO `forums` (`name`, `created_at`, `topics_count`, `updated_at`, `posts_count`, `description`) VALUES(NULL, '2010-03-29 02:56:38', 0, '2010-03-29 02:56:38', 0, NULL)

  def update
    @forum = Forum.find(params[:id])

    respond_to do |format|
      if @forum.update_attributes(params[:forum])
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 2)
UPDATE `forums` SET `updated_at` = '2010-03-29 03:51:08', `description` = '住论坛住论坛住论坛住论坛住论坛' WHERE `id` = 2

  def destroy
    @forum = Forum.find(params[:id])
    @forum.destroy
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 1)
DELETE FROM `forums` WHERE `id` = 1