app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages`

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def create
    @page = Page.new(params[:page])
    if @page.save
---
INSERT INTO `pages` (`permalink`, `created_at`, `title`, `body`, `updated_at`) VALUES('citymask_home', '2010-03-28 04:30:23', 'Welcome to citymask', 'Welcome to citymaskWelcome to citymaskWelcome to citymaskWelcome to citymaskWelcome to citymaskWelcome to citymaskWelcome to citymask', '2010-03-28 04:30:23')

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `updated_at` = '2010-03-28 04:32:00', `body` = 'Welcome to citymaskWelcome to citymaskWelcome to citymaskWelcome to\r\nalert(\"test\")' WHERE `id` = 1