app/controllers/photos_controller.rb

SELECT * FROM `photos` WHERE (`photos`.`id` = 4)
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.`id` = 4)
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO `photos` (`created_at`, `size`, `album_id`, `title`, `content_type`, `updated_at`, `thumbnail`, `user_id`, `filename`, `path`, `parent_id`, `height`, `description`, `width`) VALUES('2010-04-01 09:11:17', 2884, NULL, '1', 'image/png', '2010-04-01 09:11:17', NULL, NULL, 'Global_bg.png', NULL, NULL, 480, 'it the first', 3)
---
  def create
    @photo = Photo.new(params[:photo])
    @photo.album = @album
    @photo.user = @user
    respond_to do |format|
      if @photo.save!

SELECT * FROM `photos` WHERE (`photos`.`id` = 4)
UPDATE `photos` SET `updated_at` = '2010-04-01 09:26:06', `title` = 'adfsdfasdfasdf', `description` = 'adfadsfdfadf', `size` = 133768 WHERE `id` = 4
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

SELECT * FROM `photos` WHERE (`photos`.parent_id = 4)
DELETE FROM `photos` WHERE `id` = 5
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy

SELECT `photos`.* FROM `photos` INNER JOIN `albums` ON `photos`.album_id = `albums`.id WHERE (`photos`.`id` = 7 AND ((`albums`.user_id = 1)))
INSERT INTO `tags` (`name`) VALUES('test')
UPDATE `photos` SET `updated_at` = '2010-04-02 08:46:17', `size` = 133733 WHERE `id` = 7
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_id = 7) AND (`taggings`.taggable_type = 'Photo')) ORDER BY tags.id DESC LIMIT 1
---
  def add_tag
    @photo = @user.photos.find(params[:id])
    @photo.tag_list << params[:tag][:name]
    @photo.save
    @new_tag = @photo.reload.tags.last

SELECT `photos`.* FROM `photos` INNER JOIN `albums` ON `photos`.album_id = `albums`.id WHERE (`photos`.`id` = 7 AND ((`albums`.user_id = 1)))
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE (`tags`.`id` = 4 AND ((`taggings`.taggable_id = 7) AND (`taggings`.taggable_type = 'Photo')))
---
  def remove_tag
    @photo = @user.photos.find(params[:id])
    @tag_to_delete = @photo.tags.find(params[:tag_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `albums` WHERE (`albums`.`id` = 5)
---
  def find_user_album
    @user = User.find(params[:user_id]) if params[:user_id]
    @album = Album.find(params[:album_id]) if params[:album_id]