app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate :page => params[:page],
                           :include => :user,
                           :conditions => ['topic_id = ?', @topic],
                           :order => 'updated_at ASC'
---
SELECT * FROM `posts` WHERE (topic_id = 4) ORDER BY updated_at DESC LIMIT 0, 30

  def create
    @post = Post.new(params[:post])
    @post.user = logged_in_user
    @post.topic = @topic

    respond_to do |format|
      if @post.save && @topic.update_attributes(:updated_at => Time.now)
---
INSERT INTO `posts` (`created_at`, `body`, `updated_at`, `user_id`, `topic_id`) VALUES('2010-03-29 10:08:50', 'it is a reply', '2010-03-29 10:08:50', 1, 4)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
UPDATE `posts` SET `updated_at` = '2010-03-29 10:11:25', `body` = 'it is replay 3\r\n' WHERE `id` = 2

  def find_forum_topic
    @forum = Forum.find(params[:forum_id])
    @topic = Topic.find(params[:topic_id])
---
SELECT * FROM `forums` WHERE (`forums`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.`id` = 4)