app/controllers/roles_controller.rb

SELECT * FROM `roles`
---
  def index
    @roles = Role.all

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
---
  def update
    @role = Role.find(params[:id])

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
---
  def destroy
    @role = Role.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 3)
---
  def find_user
    @user = User.find(params[:user_id])