app/controllers/topics_controller.rb

SELECT * FROM `topics` WHERE (forum_id = 2) ORDER BY updated_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `topics` WHERE (forum_id = 1)
---
  def index
    @topics = Topic.paginate :page => params[:page],
                             :include => :user,
                             :conditions => ['forum_id = ?', @forum],
                             :order => 'updated_at DESC'

SELECT * FROM `topics` WHERE (`topics`.`id` = 3)
---
  def edit
    @topic = Topic.find(params[:id])

INSERT INTO `topics` (`created_at`, `title`, `body`, `updated_at`, `forum_id`, `posts_count`, `user_id`) VALUES('2010-03-29 06:10:05', 'dsfsdfffffffffff', NULL, '2010-03-29 06:10:05', 2, 0, 1)
INSERT INTO `users` (`created_at`, `updated_at`, `username`, `hashed_password`, `enabled`, `about`, `last_login_at`, `email`) VALUES('2010-03-29 06:34:54', '2010-03-29 06:34:54', 'Admin', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 1, NULL, NULL, 'admin@citymask.com')
---
  def create
    @topic = Topic.new(params[:topic])
    @topic.forum = @forum
    @topic.user = logged_in_user
    respond_to do |format|
      if @topic.save

SELECT * FROM `topics` WHERE (`topics`.`id` = 3)
UPDATE `topics` SET `updated_at` = '2010-03-31 03:08:07', `title` = 'testadfadfadsf' WHERE `id` = 1
---
  def update
    @topic = Topic.find(params[:id])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])

SELECT * FROM `topics` WHERE (`topics`.`id` = 1)
DELETE FROM `topics` WHERE `id` = 1
---
  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy

SELECT * FROM `forums` WHERE (`forums`.`id` = 2)
---
  def find_forum
    @forum = Forum.find(params[:forum_id])