app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 0)
SELECT * FROM `entries` WHERE (`entries`.`user_id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @entries = Entry.find_all_by_user_id(@user)

SELECT * FROM `users` WHERE (`users`.`username` = 'goldmine') LIMIT 1
---
  def show_by_name
    @user = User.find_by_username(params[:username])

INSERT INTO `users` (`created_at`, `updated_at`, `username`, `hashed_password`, `enabled`, `about`, `last_login_at`, `email`) VALUES('2010-03-28 06:05:32', '2010-03-28 06:05:32', 'goldmine', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 1, NULL, NULL, 'goldmine@163.com')
---
  def create
    @user = User.new(params[:user])
      @user.save!

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-04-02 07:00:26', `enable_comments` = 0, `blog_title` = '' WHERE `id` = 1
---
  def update
    @user = User.find(logged_in_user)
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def destroy
    @user = User.find(params[:id])